Revit 2027 API
BuiltInFailures.ColumnInsideWallFailures.StopCutShadowJoin Property
 Two joined walls are no longer in a position to allow automatic insert copying. They are either non-parallel or non-overlapping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StopCutShadowJoin { get; }
Public Shared ReadOnly Property StopCutShadowJoin As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StopCutShadowJoin {
	FailureDefinitionId^ get ();
}
static member StopCutShadowJoin : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace